STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_q.c
6. Set and clear a circular link to not empty Q :
   - Set a circular link to any Q node thanks to the following set of functions models :
     - Generic circular link Q setting function that allows to set a circular link to a any not empty Q position.
       - This functionality is ensured by HAL_Q_SetCircularLinkQ() function. The p_node parameter allows to specify
         the first circular node (Node linked to Q tail node). This function returns an error when the p_node
         is not found within the Q or the p_node parameter is null.
     - Head circular link Q setting function that allows to set a circular link to the head node of Q.
       - This functionality is ensured by HAL_Q_SetCircularLinkQ_Head() function.
     - Tail circular link Q setting function that allows to set a circular link to the tail node of Q.
       - This functionality is ensured by HAL_Q_SetCircularLinkQ_Tail() function.
   - Clear a circular link from a Q.
     - This functionality is ensured by HAL_Q_ClearCircularLinkQ() function.

## Configuration inside the Q module

Config defines           | Description     | Default value | Note
------------------------ | --------------- | ------------- | ---------------------------------------------------------
USE_ASSERT_DBG_PARAM     | from IDE        |     None      | When defined, enable the params assert.
USE_HAL_CHECK_PARAM      | from hal_conf.h |     0U        | It allows to use the run-time checks on parameters.
USE_HAL_{PPP}_LINKEDLIST | from hal_conf.h |     0U        | It allows to use the PPP in linked-list mode.
USE_HAL_Q_CIRCULAR_LINK  | from hal_ppp.h  |     0U        | It allows to use circular link queue.
  */

#if (defined(USE_HAL_Q_DIRECT_ADDR_MODE) && (USE_HAL_Q_DIRECT_ADDR_MODE == 1)) \
  || (defined(USE_HAL_Q_BASE_OFFSET_ADDR_MODE) && (USE_HAL_Q_BASE_OFFSET_ADDR_MODE == 1))

/* Private constants -------------------------------------------------------------------------------------------------*/
/* Private types -----------------------------------------------------------------------------------------------------*/
/** @defgroup Q_Private_Types Q Private Types
  * @{
  */
/*! Q operations */
typedef enum
{
  /* Node operation */
  Q_INSERT_NODE     = 0U, /*!< Q insert node operation     */
  Q_REMOVE_NODE     = 1U, /*!< Q remove node operation     */
  Q_REPLACE_NODE    = 2U, /*!< Q replace node operation    */
  /* Q operation */
  Q_INSERT_Q_HEAD   = 3U, /*!< Q insert head Q operation   */
  Q_INSERT_Q_MIDDLE = 4U, /*!< Q insert middle Q operation */
  Q_INSERT_Q_TAIL   = 5U  /*!< Q insert tail Q operation   */
} q_operation_t;

#if (USE_HAL_Q_BASE_OFFSET_ADDR_MODE) && (USE_HAL_Q_BASE_OFFSET_ADDR_MODE == 1)
/*! Q check nodes */
typedef enum
{
  Q_CHECK_HEAD_NODE = 0U, /*!< Q check only head node address */
  Q_CHECK_ALL_NODES = 1U  /*!< Q check all nodes addresses    */
} q_check_nodes_t;
#endif /* USE_HAL_Q_BASE_OFFSET_ADDR_MODE */
/**
  * @}
  */

/* Private functions -------------------------------------------------------------------------------------------------*/
/** @defgroup Q_Private_Functions Q Private Functions
  * @{
  */
static void Q_UnlinkNodes(hal_q_t *p_q, uint32_t head_node_addr);
static void Q_ResetInfo(hal_q_t *p_q);
static hal_status_t Q_FindNode(const hal_q_t *p_q, uint32_t head_node_addr, uint32_t node_addr,
                               uint32_t *p_prev_node_addr);
#if (USE_HAL_Q_BASE_OFFSET_ADDR_MODE) && (USE_HAL_Q_BASE_OFFSET_ADDR_MODE == 1)
static void Q_FormatBaseOffsetNodes(const hal_q_t *p_q, uint32_t node, q_operation_t node_operation);
static void Q_FormatBaseOffsetQ(const hal_q_t *p_dest_q, const hal_q_t *p_src_q, uint32_t node,
                                q_operation_t q_operation);
static hal_status_t Q_IsValidNodeAddr(const hal_q_t *p_q, uint32_t start_node, uint32_t node, q_check_nodes_t mode);
#endif /* USE_HAL_Q_BASE_OFFSET_ADDR_MODE */
/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @addtogroup Q_Exported_Functions Q Exported Functions
  * @{
  */

/** @addtogroup Q_Exported_Functions_Group1 Q Initialization and de-initialization functions
  * @{
This section provides functions allowing to initialize and de-initialize the logical Q object :
- Call the function HAL_Q_Init() initialize the logical Q object and associate its operation information.
- Call the function HAL_Q_DeInit() to de-initialize the logical Q object and unlink its nodes.
  */

/**
  * @brief  Initialize the logical Q object and associate its operation information.
  * @param  p_q               Pointer to a hal_q_t structure that contains Q information.
  * @param  p_desc_ops        Pointer to a hal_q_desc_ops_t structure that contains Q operation information.
  * @note                     The p_desc_ops is a constant provided by HAL PPP modules that supports linked-list feature
  *                           titled HAL_PPP_{mode}_DescOps or HAL_PPP_DescOps.
  * @retval HAL_OK            In case of valid initialization.
  * @retval HAL_INVALID_PARAM In case of invalid parameter.
  */
hal_status_t HAL_Q_Init(hal_q_t *p_q, const hal_q_desc_ops_t *p_desc_ops)
{
  ASSERT_DBG_PARAM(p_q != NULL);
  ASSERT_DBG_PARAM(p_desc_ops != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_q == NULL) || (p_desc_ops == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_desc_ops->p_get_node_info(&p_q->next_addr_offset, &p_q->addr_mode);

  p_q->p_head_node           = NULL;
  p_q->p_tail_node           = NULL;
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  p_q->p_first_circular_node = NULL;
#endif /* USE_HAL_Q_CIRCULAR_LINK */
  p_q->node_nbr              = 0U;
  p_q->p_set_node            = p_desc_ops->p_set_node;
  p_q->p_get_node            = p_desc_ops->p_get_node;

  return HAL_OK;
}

/**
  * @brief Deinitialize the logical Q object and unlink its node(s).
  * @param p_q Pointer to a hal_q_t structure that contains Q information.
  */
void HAL_Q_DeInit(hal_q_t *p_q)
{
  uint32_t head;

