STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_q.c
  ASSERT_DBG_PARAM(p_q != NULL);

  head = (uint32_t)p_q->p_head_node;

  Q_UnlinkNodes(p_q, head);

  p_q->p_head_node = NULL;
}
/**
  * @}
  */

/** @addtogroup Q_Exported_Functions_Group2 Q node insertion functions
  * @{
This section provides functions allowing to insert new node in any Q position :
- Call the function HAL_Q_InsertNode() to insert a new node in any Q position.
- Call the function HAL_Q_InsertNode_Head() to insert a new node in the head position of a Q.
- Call the function HAL_Q_InsertNode_Tail() to insert a new node in the tail position of a Q.
  */

/**
  * @brief  Insert a new node after a previous node in a Q.
  * @param  p_q               Pointer to a hal_q_t structure that contains Q information.
  * @param  p_node            Pointer to node that specifies insertion position. When null, the new node is placed at
  *                           the head of Q
  * @param  p_new_node        Pointer to new node.
  * @retval HAL_OK            In case of node inserted successfully.
  * @retval HAL_INVALID_PARAM In case of invalid parameter.
  * @retval HAL_ERROR         In case of p_prev_node node not found in the Q.
  */
hal_status_t HAL_Q_InsertNode(hal_q_t *p_q, const void *p_node, void *p_new_node)
{
  uint32_t head;
  uint32_t node;
  uint32_t new_node;
  uint32_t offset;

  ASSERT_DBG_PARAM(p_q != NULL);
  ASSERT_DBG_PARAM(p_new_node != NULL);
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  ASSERT_DBG_PARAM(p_q->p_first_circular_node == NULL);
#endif /* USE_HAL_Q_CIRCULAR_LINK */

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_new_node == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  if (p_q->p_first_circular_node != NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_Q_CIRCULAR_LINK */
#endif /* USE_HAL_CHECK_PARAM */

  head     = (uint32_t)p_q->p_head_node;
  node     = (uint32_t)p_node;
  new_node = (uint32_t)p_new_node;
  offset   = p_q->next_addr_offset;

  /* Empty Q */
  if ((p_q->p_head_node == NULL) && (p_node == NULL))
  {
    p_q->p_head_node = p_new_node;
    p_q->p_tail_node = p_new_node;
  }
  /* Not empty Q */
  else if (p_q->p_head_node != NULL)
  {
    /* Insert node at head level */
    if (p_node == NULL)
    {
#if (USE_HAL_Q_BASE_OFFSET_ADDR_MODE) && (USE_HAL_Q_BASE_OFFSET_ADDR_MODE == 1)
      if (p_q->addr_mode != HAL_Q_ADDRESSING_DIRECT)
      {
        if (Q_IsValidNodeAddr(p_q, head, new_node, Q_CHECK_ALL_NODES) == HAL_OK)
        {
          Q_FormatBaseOffsetNodes(p_q, new_node, Q_INSERT_NODE);
        }
        else
        {
          return HAL_ERROR;
        }
      }
#endif /* USE_HAL_Q_BASE_OFFSET_ADDR_MODE */

#if (USE_HAL_Q_DIRECT_ADDR_MODE) && (USE_HAL_Q_DIRECT_ADDR_MODE == 1)
      if (p_q->addr_mode == HAL_Q_ADDRESSING_DIRECT)
      {
        p_q->p_set_node(head, new_node, head, offset);
      }
#endif /* USE_HAL_Q_DIRECT_ADDR_MODE */

      p_q->p_head_node = p_new_node;
    }
    else
    {
#if (USE_HAL_Q_BASE_OFFSET_ADDR_MODE) && (USE_HAL_Q_BASE_OFFSET_ADDR_MODE == 1)
      if (p_q->addr_mode != HAL_Q_ADDRESSING_DIRECT)
      {
        if (Q_IsValidNodeAddr(p_q, head, new_node, Q_CHECK_HEAD_NODE) != HAL_OK)
        {
          return HAL_ERROR;
        }
      }
#endif /* USE_HAL_Q_BASE_OFFSET_ADDR_MODE */

      /* Insert node at tail level */
      if (p_node == p_q->p_tail_node)
      {
        p_q->p_set_node(head, node, new_node, offset);
        p_q->p_tail_node = p_new_node;
      }
      /* Insert node at middle level */
      else
      {
        /* Find node */
        if (Q_FindNode(p_q, head, node, NULL) == HAL_OK)
        {
          p_q->p_set_node(head, new_node, p_q->p_get_node(head, node, offset), offset);
          p_q->p_set_node(head, node, new_node, offset);
        }
        else
        {
          return HAL_ERROR;
        }
      }
    }
  }
  else
  {
    return HAL_ERROR;
  }

  p_q->node_nbr++;

  return HAL_OK;
}

/**
  * @brief Insert a new node in the head of the Q.
  * @param p_q                Pointer to a hal_q_t structure that contains Q information.
  * @param p_new_node         Pointer to a new node.
  * @retval HAL_OK            In case of node inserted successfully in the head of the Q.
  * @retval HAL_ERROR         In case of node not inserted.
  * @retval HAL_INVALID_PARAM In case of invalid parameter.
  */
hal_status_t HAL_Q_InsertNode_Head(hal_q_t *p_q, void *p_new_node)
{
  uint32_t head;
  uint32_t new_node;
#if (USE_HAL_Q_DIRECT_ADDR_MODE) && (USE_HAL_Q_DIRECT_ADDR_MODE == 1)
  uint32_t offset;
#endif /* USE_HAL_Q_DIRECT_ADDR_MODE */

  ASSERT_DBG_PARAM(p_q != NULL);
  ASSERT_DBG_PARAM(p_new_node != NULL);
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  ASSERT_DBG_PARAM(p_q->p_first_circular_node == NULL);
#endif /* USE_HAL_Q_CIRCULAR_LINK */

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_new_node == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  if (p_q->p_first_circular_node != NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_Q_CIRCULAR_LINK */
#endif /* USE_HAL_CHECK_PARAM */

  head     = (uint32_t)p_q->p_head_node;
  new_node = (uint32_t)p_new_node;
#if (USE_HAL_Q_DIRECT_ADDR_MODE) && (USE_HAL_Q_DIRECT_ADDR_MODE == 1)
  offset   = p_q->next_addr_offset;
#endif /* USE_HAL_Q_DIRECT_ADDR_MODE */

  /* Empty Q */
  if (p_q->p_head_node == NULL)
  {
    p_q->p_head_node = p_new_node;
    p_q->p_tail_node = p_new_node;
  }
  /* Not empty Q */
  else
  {
#if (USE_HAL_Q_BASE_OFFSET_ADDR_MODE) && (USE_HAL_Q_BASE_OFFSET_ADDR_MODE == 1)
    if (p_q->addr_mode != HAL_Q_ADDRESSING_DIRECT)
    {
      if (Q_IsValidNodeAddr(p_q, head, new_node, Q_CHECK_ALL_NODES) == HAL_OK)
      {
        Q_FormatBaseOffsetNodes(p_q, new_node, Q_INSERT_NODE);
      }
      else
      {
        return HAL_ERROR;
      }
    }
#endif /* USE_HAL_Q_BASE_OFFSET_ADDR_MODE */

#if (USE_HAL_Q_DIRECT_ADDR_MODE) && (USE_HAL_Q_DIRECT_ADDR_MODE == 1)
    if (p_q->addr_mode == HAL_Q_ADDRESSING_DIRECT)
    {
      p_q->p_set_node(head, new_node, head, offset);
    }
#endif /* USE_HAL_Q_DIRECT_ADDR_MODE */

    p_q->p_head_node = p_new_node;
  }

  p_q->node_nbr++;

  return HAL_OK;
}

/**
  * @brief  Insert a new node in the tail of the Q.
  * @param  p_q               Pointer to a hal_q_t structure that contains Q information.
  * @param  p_new_node        Pointer to a new node.
  * @retval HAL_OK            In case of node inserted successfully in the tail of the Q.
  * @retval HAL_ERROR         In case of node not inserted.
  * @retval HAL_INVALID_PARAM In case of invalid parameter.
  */
hal_status_t HAL_Q_InsertNode_Tail(hal_q_t *p_q, void *p_new_node)
{
  uint32_t head;
  uint32_t tail;
  uint32_t new_node;
  uint32_t offset;

