STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_q.c
  ASSERT_DBG_PARAM(p_q != NULL);
  ASSERT_DBG_PARAM(p_new_node != NULL);
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  ASSERT_DBG_PARAM(p_q->p_first_circular_node == NULL);
#endif /* USE_HAL_Q_CIRCULAR_LINK */

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_new_node == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  if (p_q->p_first_circular_node != NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_Q_CIRCULAR_LINK */
#endif /* USE_HAL_CHECK_PARAM */

  head     = (uint32_t)p_q->p_head_node;
  tail     = (uint32_t)p_q->p_tail_node;
  new_node = (uint32_t)p_new_node;
  offset   = p_q->next_addr_offset;

  /* Empty Q */
  if (p_q->p_head_node == NULL)
  {
    p_q->p_head_node = p_new_node;
    p_q->p_tail_node = p_new_node;
  }
  /* Not empty Q */
  else
  {
#if (USE_HAL_Q_BASE_OFFSET_ADDR_MODE) && (USE_HAL_Q_BASE_OFFSET_ADDR_MODE == 1)
    if (p_q->addr_mode != HAL_Q_ADDRESSING_DIRECT)
    {
      if (Q_IsValidNodeAddr(p_q, head, new_node, Q_CHECK_HEAD_NODE) != HAL_OK)
      {
        return HAL_ERROR;
      }
    }
#endif /* USE_HAL_Q_BASE_OFFSET_ADDR_MODE */

    p_q->p_set_node(head, tail, new_node, offset);
    p_q->p_tail_node = p_new_node;
  }

  p_q->node_nbr++;

  return HAL_OK;
}
/**
  * @}
  */


/** @addtogroup Q_Exported_Functions_Group3 Q node removing functions
  * @{
This section provides functions allowing to remove any existing node from a Q :
- Call the function HAL_Q_RemoveNode() to remove any existing node from a Q.
- Call the function HAL_Q_RemoveNode_Head() to remove the head node from a Q.
- Call the function HAL_Q_RemoveNode_Tail() to remove the tail node from a Q.
  */

/**
  * @brief  Remove node from the Q.
  * @param  p_q               Pointer to a hal_q_t structure that contains Q information.
  * @param  p_node            Pointer to a previous node.
  * @retval HAL_OK            In case of node removed successfully.
  * @retval HAL_INVALID_PARAM In case of invalid parameter.
  * @retval HAL_ERROR         In case of node not found in the Q.
  */
hal_status_t HAL_Q_RemoveNode(hal_q_t *p_q, const void *p_node)
{
  uint32_t prev;
  uint32_t head;
  uint32_t tail;
  uint32_t node;
  uint32_t offset;
#if (USE_HAL_Q_BASE_OFFSET_ADDR_MODE) && (USE_HAL_Q_BASE_OFFSET_ADDR_MODE == 1)
  uint32_t new_head;
  uint32_t next_node;
#endif /* USE_HAL_Q_BASE_OFFSET_ADDR_MODE */

  ASSERT_DBG_PARAM(p_q != NULL);
  ASSERT_DBG_PARAM(p_node != NULL);
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  ASSERT_DBG_PARAM(p_q->p_first_circular_node == NULL);
#endif /* USE_HAL_Q_CIRCULAR_LINK */

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_node == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  if (p_q->p_first_circular_node != NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_Q_CIRCULAR_LINK */
#endif /* USE_HAL_CHECK_PARAM */

  head   = (uint32_t)p_q->p_head_node;
  tail   = (uint32_t)p_q->p_tail_node;
  node   = (uint32_t)p_node;
  offset = p_q->next_addr_offset;

  /* Delete head node */
  if (p_node == p_q->p_head_node)
  {
    if (p_q->node_nbr == 1U)
    {
      Q_ResetInfo(p_q);
    }
    else
    {
#if (USE_HAL_Q_BASE_OFFSET_ADDR_MODE) && (USE_HAL_Q_BASE_OFFSET_ADDR_MODE == 1)
      if (p_q->addr_mode != HAL_Q_ADDRESSING_DIRECT)
      {
        /* Get new head and next node */
        new_head = p_q->p_get_node(head, head, offset);
        next_node = p_q->p_get_node(head, new_head, offset);

        if (Q_IsValidNodeAddr(p_q, next_node, new_head, Q_CHECK_ALL_NODES) == HAL_OK)
        {
          Q_FormatBaseOffsetNodes(p_q, p_q->p_get_node(head, head, offset), Q_REMOVE_NODE);
        }
        else
        {
          return HAL_ERROR;
        }
      }
#endif /* USE_HAL_Q_BASE_OFFSET_ADDR_MODE */

      /* Set the new head node */
      p_q->p_head_node = (void *)(p_q->p_get_node(head, head, offset));
      p_q->p_set_node(0U, node, 0U, offset);
    }
  }
  else
  {
    /* Delete tail node */
    if (p_node == p_q->p_tail_node)
    {
      prev = tail;
    }
    /* Delete middle node */
    else
    {
      prev = node;
    }

    if (Q_FindNode(p_q, head, prev, &prev) != HAL_OK)
    {
      return HAL_ERROR;
    }

    /* Delete tail node */
    if (p_node == p_q->p_tail_node)
    {
      /* Set the new tail node */
      p_q->p_tail_node = (void *)prev;
      p_q->p_set_node(0U, prev, 0U, offset);
    }
    /* Delete middle node */
    else
    {
      p_q->p_set_node(head, prev, p_q->p_get_node(head, node, offset), offset);
      p_q->p_set_node(0U, node, 0U, offset);
    }
  }

  p_q->node_nbr--;

  return HAL_OK;
}

/**
  * @brief  Remove the head node of Q.
  * @param  p_q               Pointer to a hal_q_t structure that contains Q information.
  * @retval HAL_OK            In case of head node removed successfully.
  * @retval HAL_ERROR         In case of node not found.
  * @retval HAL_INVALID_PARAM In case of invalid parameter.
  */
hal_status_t HAL_Q_RemoveNode_Head(hal_q_t *p_q)
{
  uint32_t head;
  uint32_t offset;
#if (USE_HAL_Q_BASE_OFFSET_ADDR_MODE) && (USE_HAL_Q_BASE_OFFSET_ADDR_MODE == 1)
  uint32_t new_head;
  uint32_t next_node;
#endif /* USE_HAL_Q_BASE_OFFSET_ADDR_MODE */

  ASSERT_DBG_PARAM(p_q != NULL);
  ASSERT_DBG_PARAM(p_q->p_head_node != NULL);
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  ASSERT_DBG_PARAM(p_q->p_first_circular_node == NULL);
#endif /* USE_HAL_Q_CIRCULAR_LINK */

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_q->p_head_node == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  if (p_q->p_first_circular_node != NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_Q_CIRCULAR_LINK */
#endif /* USE_HAL_CHECK_PARAM */

  offset = p_q->next_addr_offset;

  if (p_q->node_nbr == 1U)
  {
    Q_ResetInfo(p_q);
  }
  else
  {
    /* Store the old head node */
    head = (uint32_t)p_q->p_head_node;

#if (USE_HAL_Q_BASE_OFFSET_ADDR_MODE) && (USE_HAL_Q_BASE_OFFSET_ADDR_MODE == 1)
    if (p_q->addr_mode != HAL_Q_ADDRESSING_DIRECT)
    {
      new_head  = p_q->p_get_node(head, head, offset);
      next_node = p_q->p_get_node(head, new_head, offset);

      if (Q_IsValidNodeAddr(p_q, next_node, new_head, Q_CHECK_ALL_NODES) == HAL_OK)
      {
        Q_FormatBaseOffsetNodes(p_q, p_q->p_get_node(head, head, offset), Q_REMOVE_NODE);
      }
      else
      {
        return HAL_ERROR;
      }
    }
#endif /* USE_HAL_Q_BASE_OFFSET_ADDR_MODE */

    /* Set the new head node */
    p_q->p_head_node = (void *)(p_q->p_get_node(head, head, offset));
    p_q->p_set_node(0U, head, 0U, offset);
  }

  p_q->node_nbr--;

  return HAL_OK;
}

/**
  * @brief  Remove the tail node of Q.
  * @param  p_q               Pointer to a hal_q_t structure that contains Q information.
  * @retval HAL_OK            In case of tail node removed successfully.
  * @retval HAL_ERROR         In case of node not found.
  * @retval HAL_INVALID_PARAM In case of invalid parameter.
  */
hal_status_t HAL_Q_RemoveNode_Tail(hal_q_t *p_q)
{
  uint32_t prev = 0U;
  uint32_t head;
  uint32_t tail;
  uint32_t offset;

