STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_q.c
  ASSERT_DBG_PARAM(p_q != NULL);
  ASSERT_DBG_PARAM(p_q->p_tail_node != NULL);
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  ASSERT_DBG_PARAM(p_q->p_first_circular_node == NULL);
#endif /* USE_HAL_Q_CIRCULAR_LINK */

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_q->p_tail_node == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  if (p_q->p_first_circular_node != NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_Q_CIRCULAR_LINK */
#endif /* USE_HAL_CHECK_PARAM */

  head   = (uint32_t)p_q->p_head_node;
  tail   = (uint32_t)p_q->p_tail_node;
  offset = p_q->next_addr_offset;

  if (p_q->node_nbr == 1U)
  {
    Q_ResetInfo(p_q);
  }
  else
  {
    if (Q_FindNode(p_q, head, tail, &prev) != HAL_OK)
    {
      return HAL_ERROR;
    }

    /* Set the new tail node */
    p_q->p_tail_node = (void *)prev;
    p_q->p_set_node(0U, prev, 0U, offset);
  }

  p_q->node_nbr--;

  return HAL_OK;
}
/**
  * @}
  */


/** @addtogroup Q_Exported_Functions_Group4 Q node replacing functions
  * @{
This section provides functions allowing to replace any existing node in a Q :
- Call the function HAL_Q_ReplaceNode() to replace any existing node by a new node in a Q.
- Call the function HAL_Q_ReplaceNode_Head() to replace the head node in a Q.
- Call the function HAL_Q_ReplaceNode_Tail() to replace the tail node in a Q.
  */

/**
  * @brief  Replace node in the Q.
  * @param  p_q               Pointer to a hal_q_t structure that contains Q information.
  * @param  p_old_node        Pointer to a old node.
  * @param  p_new_node        Pointer to a new node.
  * @retval HAL_OK            In case of node replaced successfully.
  * @retval HAL_INVALID_PARAM In case of invalid parameter.
  * @retval HAL_ERROR         In case of old node not found in the Q.
  */
hal_status_t HAL_Q_ReplaceNode(hal_q_t *p_q, const void *p_old_node, void *p_new_node)
{
  uint32_t prev;
  uint32_t head;
  uint32_t tail;
  uint32_t new_node;
  uint32_t old_node;
  uint32_t offset;

  ASSERT_DBG_PARAM(p_q != NULL);
  ASSERT_DBG_PARAM(p_old_node != NULL);
  ASSERT_DBG_PARAM(p_new_node != NULL);
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  ASSERT_DBG_PARAM(p_q->p_first_circular_node == NULL);
#endif /* USE_HAL_Q_CIRCULAR_LINK */

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_old_node == NULL) || (p_new_node == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  if (p_q->p_first_circular_node != NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_Q_CIRCULAR_LINK */
#endif /* USE_HAL_CHECK_PARAM */

  head     = (uint32_t)p_q->p_head_node;
  tail     = (uint32_t)p_q->p_tail_node;
  new_node = (uint32_t)p_new_node;
  old_node = (uint32_t)p_old_node;
  offset   = p_q->next_addr_offset;

  if (p_old_node == p_q->p_head_node)
  {
    if (p_q->node_nbr == 1U)
    {
      p_q->p_tail_node = p_new_node;
    }
    else
    {
#if (USE_HAL_Q_BASE_OFFSET_ADDR_MODE) && (USE_HAL_Q_BASE_OFFSET_ADDR_MODE == 1)
      if (p_q->addr_mode != HAL_Q_ADDRESSING_DIRECT)
      {
        if (Q_IsValidNodeAddr(p_q, head, new_node, Q_CHECK_ALL_NODES) == HAL_OK)
        {
          Q_FormatBaseOffsetNodes(p_q, new_node, Q_REPLACE_NODE);
        }
        else
        {
          return HAL_ERROR;
        }
      }
#endif /* USE_HAL_Q_BASE_OFFSET_ADDR_MODE */

#if (USE_HAL_Q_DIRECT_ADDR_MODE) && (USE_HAL_Q_DIRECT_ADDR_MODE == 1)
      if (p_q->addr_mode == HAL_Q_ADDRESSING_DIRECT)
      {
        p_q->p_set_node(head, new_node, p_q->p_get_node(head, head, offset), offset);
      }
#endif /* USE_HAL_Q_DIRECT_ADDR_MODE */

      p_q->p_set_node(0U, head, 0U, offset);
    }

    p_q->p_head_node = p_new_node;
  }
  else
  {
#if (USE_HAL_Q_BASE_OFFSET_ADDR_MODE) && (USE_HAL_Q_BASE_OFFSET_ADDR_MODE == 1)
    if (p_q->addr_mode != HAL_Q_ADDRESSING_DIRECT)
    {
      if (Q_IsValidNodeAddr(p_q, head, new_node, Q_CHECK_HEAD_NODE) != HAL_OK)
      {
        return HAL_ERROR;
      }
    }
#endif /* USE_HAL_Q_BASE_OFFSET_ADDR_MODE */

    if (p_old_node == p_q->p_tail_node)
    {
      prev = tail;
    }
    else
    {
      prev = old_node;
    }

    if (Q_FindNode(p_q, head, prev, &prev) != HAL_OK)
    {
      return HAL_ERROR;
    }

    if (p_old_node == p_q->p_tail_node)
    {
      p_q->p_set_node(head, prev, new_node, offset);
      p_q->p_tail_node = p_new_node;
    }
    else
    {
      p_q->p_set_node(head, new_node, p_q->p_get_node(head, old_node, offset), offset);
      p_q->p_set_node(head, prev, new_node, offset);
      p_q->p_set_node(0U, old_node, 0U, offset);
    }
  }

  return HAL_OK;
}

/**
  * @brief  Replace the head node in the Q.
  * @param  p_q               Pointer to a hal_q_t structure that contains Q information.
  * @param  p_new_node        Pointer to a new node.
  * @retval HAL_OK            In case of head node replaced successfully.
  * @retval HAL_ERROR         In case of old node not found in the Q.
  * @retval HAL_INVALID_PARAM In case of invalid parameter.
  */
hal_status_t HAL_Q_ReplaceNode_Head(hal_q_t *p_q, void *p_new_node)
{
  uint32_t head;
  uint32_t new_node;
  uint32_t offset;

  ASSERT_DBG_PARAM(p_q != NULL);
  ASSERT_DBG_PARAM(p_q->p_head_node != NULL);
  ASSERT_DBG_PARAM(p_new_node != NULL);
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  ASSERT_DBG_PARAM(p_q->p_first_circular_node == NULL);
#endif /* USE_HAL_Q_CIRCULAR_LINK */

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_q->p_head_node == NULL) || (p_new_node == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  if (p_q->p_first_circular_node != NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_Q_CIRCULAR_LINK */
#endif /* USE_HAL_CHECK_PARAM */

  head     = (uint32_t)p_q->p_head_node;
  new_node = (uint32_t)p_new_node;
  offset   = p_q->next_addr_offset;

  if (p_q->node_nbr == 1U)
  {
    p_q->p_tail_node = p_new_node;
  }
  else
  {
#if (USE_HAL_Q_BASE_OFFSET_ADDR_MODE) && (USE_HAL_Q_BASE_OFFSET_ADDR_MODE == 1)
    if (p_q->addr_mode != HAL_Q_ADDRESSING_DIRECT)
    {
      if (Q_IsValidNodeAddr(p_q, head, new_node, Q_CHECK_ALL_NODES) == HAL_OK)
      {
        Q_FormatBaseOffsetNodes(p_q, new_node, Q_REPLACE_NODE);
      }
      else
      {
        return HAL_ERROR;
      }
    }
#endif /* USE_HAL_Q_BASE_OFFSET_ADDR_MODE */

#if (USE_HAL_Q_DIRECT_ADDR_MODE) && (USE_HAL_Q_DIRECT_ADDR_MODE == 1)
    if (p_q->addr_mode == HAL_Q_ADDRESSING_DIRECT)
    {
      p_q->p_set_node(head, new_node, p_q->p_get_node(head, head, offset), offset);
    }
#endif /* USE_HAL_Q_DIRECT_ADDR_MODE */

    p_q->p_set_node(0U, head, 0U, offset);
  }

  p_q->p_head_node = p_new_node;

  return HAL_OK;
}

/**
  * @brief  Replace the tail node in the Q.
  * @param  p_q               Pointer to a hal_q_t structure that contains Q information.
  * @param  p_new_node        Pointer to a new node.
  * @retval HAL_OK            In case of tail node replaced successfully.
  * @retval HAL_ERROR         In case of old node not found in the Q.
  * @retval HAL_INVALID_PARAM In case of invalid parameter.
  */
hal_status_t HAL_Q_ReplaceNode_Tail(hal_q_t *p_q, void *p_new_node)
{
  uint32_t prev = 0U;
  uint32_t head;
  uint32_t tail;
  uint32_t new_node;
  uint32_t offset;

