STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_q.c
  ASSERT_DBG_PARAM(p_q != NULL);
  ASSERT_DBG_PARAM(p_new_node != NULL);
  ASSERT_DBG_PARAM(p_q->p_tail_node != NULL);
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  ASSERT_DBG_PARAM(p_q->p_first_circular_node == NULL);
#endif /* USE_HAL_Q_CIRCULAR_LINK */

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_q->p_tail_node == NULL) || (p_new_node == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  if (p_q->p_first_circular_node != NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_Q_CIRCULAR_LINK */
#endif /* USE_HAL_CHECK_PARAM */

  head     = (uint32_t)p_q->p_head_node;
  tail     = (uint32_t)p_q->p_tail_node;
  new_node = (uint32_t)p_new_node;
  offset   = p_q->next_addr_offset;

  if (p_q->node_nbr == 1U)
  {
    p_q->p_head_node = p_new_node;
  }
  else
  {
#if (USE_HAL_Q_BASE_OFFSET_ADDR_MODE) && (USE_HAL_Q_BASE_OFFSET_ADDR_MODE == 1)
    if (p_q->addr_mode != HAL_Q_ADDRESSING_DIRECT)
    {
      if (Q_IsValidNodeAddr(p_q, head, new_node, Q_CHECK_HEAD_NODE) != HAL_OK)
      {
        return HAL_ERROR;
      }
    }
#endif /* USE_HAL_Q_BASE_OFFSET_ADDR_MODE */

    /* Find the tail previous node */
    if (Q_FindNode(p_q, head, tail, &prev) != HAL_OK)
    {
      return HAL_ERROR;
    }

    p_q->p_set_node(head, prev, new_node, offset);
  }

  p_q->p_tail_node = p_new_node;

  return HAL_OK;
}
/**
  * @}
  */


/** @addtogroup Q_Exported_Functions_Group5 Q inserting Q functions
  * @{
This section provides functions allowing to insert a source Q in any destination Q position :
- Call the function HAL_Q_InsertQ() to insert a source Q in any destination Q position.
- Call the function HAL_Q_InsertQ_Head() to insert a source Q before all destination Q node(s).
- Call the function HAL_Q_InsertQ_Tail() to insert a source Q after all destination Q node(s).
  */

/**
  * @brief  Insert a source Q directly after the previous node in the destination Q.
  * @param  p_dest_q Pointer to a hal_q_t structure that contains Q information.
  * @param  p_src_q  Pointer to a hal_q_t structure that contains Q information.
  * @param  p_node   Pointer to a previous node. When null, the source Q node(s) is placed at the head of destination Q.
  * @retval HAL_OK            In case of source Q inserted successfully in destination Q.
  * @retval HAL_INVALID_PARAM In case of invalid parameter.
  * @retval HAL_ERROR         In case of p_prev_node node not found in the Q.
  */
hal_status_t HAL_Q_InsertQ(hal_q_t *p_dest_q, hal_q_t *p_src_q, const void *p_node)
{
  uint32_t src_head;
  uint32_t dest_head;
#if (USE_HAL_Q_DIRECT_ADDR_MODE) && (USE_HAL_Q_DIRECT_ADDR_MODE == 1)
  uint32_t src_tail;
  uint32_t dest_tail;
  uint32_t offset;
#endif /* USE_HAL_Q_DIRECT_ADDR_MODE */
  uint32_t node_addr;

  ASSERT_DBG_PARAM(p_src_q != NULL);
  ASSERT_DBG_PARAM(p_dest_q != NULL);
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  ASSERT_DBG_PARAM(p_src_q->p_first_circular_node == NULL);
  ASSERT_DBG_PARAM(p_dest_q->p_first_circular_node == NULL);
#endif /* USE_HAL_Q_CIRCULAR_LINK */

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  if ((p_src_q->p_first_circular_node != NULL) || (p_dest_q->p_first_circular_node != NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_Q_CIRCULAR_LINK */
#endif /* USE_HAL_CHECK_PARAM */

  src_head  = (uint32_t)p_src_q->p_head_node;
  dest_head = (uint32_t)p_dest_q->p_head_node;
#if (USE_HAL_Q_DIRECT_ADDR_MODE) && (USE_HAL_Q_DIRECT_ADDR_MODE == 1)
  src_tail  = (uint32_t)p_src_q->p_tail_node;
  dest_tail = (uint32_t)p_dest_q->p_tail_node;
  offset    = p_dest_q->next_addr_offset;
#endif /* USE_HAL_Q_DIRECT_ADDR_MODE */
  node_addr = (uint32_t)p_node;

  /* Empty source Q */
  if (p_src_q->node_nbr == 0U)
  {
    return HAL_OK;
  }

  /* Empty destination Q */
  if (p_dest_q->p_head_node == NULL)
  {
    p_dest_q->p_head_node = p_src_q->p_head_node;
    p_dest_q->p_tail_node = p_src_q->p_tail_node;
  }
  /* Not empty destination Q */
  else
  {
    /* Insert source Q at head level of destination Q */
    if (p_node == NULL)
    {
#if (USE_HAL_Q_BASE_OFFSET_ADDR_MODE) && (USE_HAL_Q_BASE_OFFSET_ADDR_MODE == 1)
      if (p_dest_q->addr_mode != HAL_Q_ADDRESSING_DIRECT)
      {
        if (Q_IsValidNodeAddr(p_dest_q, dest_head, src_head, Q_CHECK_ALL_NODES) == HAL_OK)
        {
          Q_FormatBaseOffsetQ(p_dest_q, p_src_q, src_head, Q_INSERT_Q_HEAD);
        }
        else
        {
          return HAL_ERROR;
        }
      }
#endif /* USE_HAL_Q_BASE_OFFSET_ADDR_MODE */

#if (USE_HAL_Q_DIRECT_ADDR_MODE) && (USE_HAL_Q_DIRECT_ADDR_MODE == 1)
      if (p_dest_q->addr_mode == HAL_Q_ADDRESSING_DIRECT)
      {
        /* Link source Q tail node address to destination Q head node address */
        p_src_q->p_set_node(src_head, src_tail, dest_head, offset);
      }
#endif /* USE_HAL_Q_DIRECT_ADDR_MODE */

      /* Set destination Q head node as source Q head node */
      p_dest_q->p_head_node = p_src_q->p_head_node;
    }
    else
    {
      if (Q_FindNode(p_dest_q, dest_head, node_addr, NULL) != HAL_OK)
      {
        return HAL_ERROR;
      }

#if (USE_HAL_Q_BASE_OFFSET_ADDR_MODE) && (USE_HAL_Q_BASE_OFFSET_ADDR_MODE == 1)
      if (p_dest_q->addr_mode != HAL_Q_ADDRESSING_DIRECT)
      {
        if (Q_IsValidNodeAddr(p_src_q, src_head, dest_head, Q_CHECK_ALL_NODES) == HAL_OK)
        {
          if (p_node == p_dest_q->p_tail_node)
          {
            Q_FormatBaseOffsetQ(p_dest_q, p_src_q, dest_head, Q_INSERT_Q_TAIL);
          }
          else
          {
            Q_FormatBaseOffsetQ(p_dest_q, p_src_q, node_addr, Q_INSERT_Q_MIDDLE);
          }
        }
        else
        {
          return HAL_ERROR;
        }
      }
#endif /* USE_HAL_Q_BASE_OFFSET_ADDR_MODE */

#if (USE_HAL_Q_DIRECT_ADDR_MODE) && (USE_HAL_Q_DIRECT_ADDR_MODE == 1)
      if (p_dest_q->addr_mode == HAL_Q_ADDRESSING_DIRECT)
      {
        if (p_node == p_dest_q->p_tail_node)
        {
          /* Link source Q to tail destination Q */
          p_src_q->p_set_node(dest_head, dest_tail, src_head, offset);
        }
        else
        {
          /* Link source Q to middle destination Q */
          p_dest_q->p_set_node(dest_head, src_tail, p_dest_q->p_get_node(dest_head, node_addr, offset), offset);
          p_dest_q->p_set_node(dest_head, node_addr, src_head, offset);
        }
      }
#endif /* USE_HAL_Q_DIRECT_ADDR_MODE */

      if (p_node == p_dest_q->p_tail_node)
      {
        /* Set source Q tail node as destination Q tail node */
        p_dest_q->p_tail_node = p_src_q->p_tail_node;
      }
    }
  }

  /* Set destination Q node number */
  p_dest_q->node_nbr += p_src_q->node_nbr;

