STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_q.c
  Q_ResetInfo(p_src_q);
  p_src_q->node_nbr = 0U;

  return HAL_OK;
}

/**
  * @brief  Insert a source Q in the head of destination Q.
  * @param  p_dest_q          Pointer to a hal_q_t structure that contains Q information.
  * @param  p_src_q           Pointer to a hal_q_t structure that contains Q information.
  * @retval HAL_OK            In case of head source Q inserted successfully in head destination Q.
  * @retval HAL_ERROR         In case of source Q not inserted in destination Q.
  * @retval HAL_INVALID_PARAM In case of invalid parameter.
  */
hal_status_t HAL_Q_InsertQ_Head(hal_q_t *p_dest_q, hal_q_t *p_src_q)
{
  uint32_t src_head;
  uint32_t dest_head;
#if (USE_HAL_Q_DIRECT_ADDR_MODE) && (USE_HAL_Q_DIRECT_ADDR_MODE == 1)
  uint32_t src_tail;
  uint32_t offset;
#endif /* USE_HAL_Q_DIRECT_ADDR_MODE */

  ASSERT_DBG_PARAM(p_src_q != NULL);
  ASSERT_DBG_PARAM(p_dest_q != NULL);
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  ASSERT_DBG_PARAM(p_src_q->p_first_circular_node == NULL);
  ASSERT_DBG_PARAM(p_dest_q->p_first_circular_node == NULL);
#endif /* USE_HAL_Q_CIRCULAR_LINK */

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  if ((p_src_q->p_first_circular_node != NULL) || (p_dest_q->p_first_circular_node != NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_Q_CIRCULAR_LINK */
#endif /* USE_HAL_CHECK_PARAM */

  src_head  = (uint32_t)p_src_q->p_head_node;
  dest_head = (uint32_t)p_dest_q->p_head_node;
#if (USE_HAL_Q_DIRECT_ADDR_MODE) && (USE_HAL_Q_DIRECT_ADDR_MODE == 1)
  src_tail  = (uint32_t)p_src_q->p_tail_node;
  offset    = p_dest_q->next_addr_offset;
#endif /* USE_HAL_Q_DIRECT_ADDR_MODE */

  if (p_src_q->node_nbr == 0U)
  {
    return HAL_OK;
  }

  /* Empty destination Q */
  if (p_dest_q->p_head_node == NULL)
  {
    p_dest_q->p_head_node = p_src_q->p_head_node;
    p_dest_q->p_tail_node = p_src_q->p_tail_node;
  }
  /* Not empty destination Q */
  else
  {
#if (USE_HAL_Q_BASE_OFFSET_ADDR_MODE) && (USE_HAL_Q_BASE_OFFSET_ADDR_MODE == 1)
    if (p_dest_q->addr_mode != HAL_Q_ADDRESSING_DIRECT)
    {
      if (Q_IsValidNodeAddr(p_dest_q, dest_head, src_head, Q_CHECK_ALL_NODES) == HAL_OK)
      {
        Q_FormatBaseOffsetQ(p_dest_q, p_src_q, src_head, Q_INSERT_Q_HEAD);
      }
      else
      {
        return HAL_ERROR;
      }
    }
#endif /* USE_HAL_Q_BASE_OFFSET_ADDR_MODE */

#if (USE_HAL_Q_DIRECT_ADDR_MODE) && (USE_HAL_Q_DIRECT_ADDR_MODE == 1)
    if (p_dest_q->addr_mode == HAL_Q_ADDRESSING_DIRECT)
    {
      /* Link source Q tail node address to destination Q head node address */
      p_src_q->p_set_node(src_head, src_tail, dest_head, offset);
    }
#endif /* USE_HAL_Q_DIRECT_ADDR_MODE */

    /* Set destination Q head node as source Q head node */
    p_dest_q->p_head_node = p_src_q->p_head_node;
  }

  /* Set node number of new Q */
  p_dest_q->node_nbr += p_src_q->node_nbr;

  Q_ResetInfo(p_src_q);
  p_src_q->node_nbr = 0U;

  return HAL_OK;
}

/**
  * @brief  Insert a source Q in the tail of destination Q.
  * @param  p_dest_q          Pointer to a hal_q_t structure that contains Q information.
  * @param  p_src_q           Pointer to a hal_q_t structure that contains Q information.
  * @retval HAL_OK            In case of tail source Q inserted successfully in tail destination Q.
  * @retval HAL_ERROR         In case of source Q not inserted in destination Q.
  * @retval HAL_INVALID_PARAM In case of invalid parameter.
  */
hal_status_t HAL_Q_InsertQ_Tail(hal_q_t *p_dest_q, hal_q_t *p_src_q)
{
  uint32_t src_head_addr;
  uint32_t dest_head_addr;
#if (USE_HAL_Q_DIRECT_ADDR_MODE) && (USE_HAL_Q_DIRECT_ADDR_MODE == 1)
  uint32_t dest_tail_addr;
  uint32_t offset;
#endif /* USE_HAL_Q_DIRECT_ADDR_MODE */

  ASSERT_DBG_PARAM(p_src_q != NULL);
  ASSERT_DBG_PARAM(p_dest_q != NULL);
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  ASSERT_DBG_PARAM(p_src_q->p_first_circular_node == NULL);
  ASSERT_DBG_PARAM(p_dest_q->p_first_circular_node == NULL);
#endif /* USE_HAL_Q_CIRCULAR_LINK */

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  if ((p_src_q->p_first_circular_node != NULL) || (p_dest_q->p_first_circular_node != NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_Q_CIRCULAR_LINK */
#endif /* USE_HAL_CHECK_PARAM */

  src_head_addr  = (uint32_t)p_src_q->p_head_node;
  dest_head_addr = (uint32_t)p_dest_q->p_head_node;
#if (USE_HAL_Q_DIRECT_ADDR_MODE) && (USE_HAL_Q_DIRECT_ADDR_MODE == 1)
  dest_tail_addr = (uint32_t)p_dest_q->p_tail_node;
  offset         = p_dest_q->next_addr_offset;
#endif /* USE_HAL_Q_DIRECT_ADDR_MODE */

  /* Check if source Q is empty */
  if (p_src_q->node_nbr == 0U)
  {
    return HAL_OK;
  }

  /* Empty destination Q */
  if (p_dest_q->p_head_node == NULL)
  {
    p_dest_q->p_head_node   = p_src_q->p_head_node;
    p_dest_q->p_tail_node   = p_src_q->p_tail_node;
  }
  /* Not empty destination Q */
  else
  {
#if (USE_HAL_Q_BASE_OFFSET_ADDR_MODE) && (USE_HAL_Q_BASE_OFFSET_ADDR_MODE == 1)
    if (p_dest_q->addr_mode != HAL_Q_ADDRESSING_DIRECT)
    {
      if (Q_IsValidNodeAddr(p_src_q, src_head_addr, dest_head_addr, Q_CHECK_ALL_NODES) == HAL_OK)
      {
        Q_FormatBaseOffsetQ(p_dest_q, p_src_q, dest_head_addr, Q_INSERT_Q_TAIL);
      }
      else
      {
        return HAL_ERROR;
      }
    }
#endif /* USE_HAL_Q_BASE_OFFSET_ADDR_MODE */

#if (USE_HAL_Q_DIRECT_ADDR_MODE) && (USE_HAL_Q_DIRECT_ADDR_MODE == 1)
    if (p_dest_q->addr_mode == HAL_Q_ADDRESSING_DIRECT)
    {
      /* Link source Q tail node address to destination Q head node address */
      p_src_q->p_set_node(dest_head_addr, dest_tail_addr, src_head_addr, offset);
    }
#endif /* USE_HAL_Q_DIRECT_ADDR_MODE */

    /* Set destination Q tail node as source Q tail node */
    p_dest_q->p_tail_node = p_src_q->p_tail_node;
  }

  /* Set node number of new Q */
  p_dest_q->node_nbr += p_src_q->node_nbr;

