STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_q.c
  Q_ResetInfo(p_src_q);
  p_src_q->node_nbr = 0U;

  return HAL_OK;
}
/**
  * @}
  */

#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
/** @addtogroup Q_Exported_Functions_Group6 Q circularizing Q functions
  * @{
This section provides functions allowing to set and clear a circular link to any node in not empty Q :
- Call the function HAL_Q_SetCircularLinkQ() to set a circular link to any node in not empty Q.
- Call the function HAL_Q_SetCircularLinkQ_Head() to set a circular link to the head Q node.
- Call the function HAL_Q_SetCircularLinkQ_Tail() to set a circular link to the tail Q node.
- Call the function HAL_Q_ClearCircularLinkQ() to clear any existent circular link in a Q.
  */

/**
  * @brief  Set circular link to any selected Q node.
  * @param  p_q               Pointer to a hal_q_t structure that contains Q information.
  * @param  p_node            Pointer to first circular node.
  * @retval HAL_OK            In case of Q is circularized.
  * @retval HAL_INVALID_PARAM In case of invalid parameter.
  * @retval HAL_ERROR         In case of p_node node not found in the Q.
  */
hal_status_t HAL_Q_SetCircularLinkQ(hal_q_t *p_q, void *p_node)
{
  uint32_t head;
  uint32_t tail;
  uint32_t node;
  uint32_t offset;

  ASSERT_DBG_PARAM(p_q != NULL);
  ASSERT_DBG_PARAM(p_q->p_head_node != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_q->p_head_node == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  head   = (uint32_t)p_q->p_head_node;
  tail   = (uint32_t)p_q->p_tail_node;
  node   = (uint32_t)p_node;
  offset = p_q->next_addr_offset;

  if (Q_FindNode(p_q, head, node, NULL) == HAL_OK)
  {
    /* Link the tail node to the p_node */
    p_q->p_set_node(head, tail, node, offset);

    /* Update first circular node in Q */
    p_q->p_first_circular_node = p_node;
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief Set Q circular mode.
  * @param p_q                Pointer to a hal_q_t structure that contains Q information.
  * @retval HAL_OK            In case of Q is circularized on Head.
  * @retval HAL_INVALID_PARAM In case of invalid parameter.
  */
hal_status_t HAL_Q_SetCircularLinkQ_Head(hal_q_t *p_q)
{
  uint32_t head;
  uint32_t tail;
  uint32_t offset;

  ASSERT_DBG_PARAM(p_q != NULL);
  ASSERT_DBG_PARAM(p_q->p_head_node != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_q->p_head_node == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  head   = (uint32_t)p_q->p_head_node;
  tail   = (uint32_t)p_q->p_tail_node;
  offset = p_q->next_addr_offset;

  /* Link the tail node to the head node */
  p_q->p_set_node(head, tail, head, offset);

  /* Update first circular node in Q */
  p_q->p_first_circular_node = p_q->p_head_node;

  return HAL_OK;
}

/**
  * @brief  Set Q circular mode.
  * @param  p_q               Pointer to a hal_q_t structure that contains Q information.
  * @retval HAL_OK            In case of Q is circularized on Tail.
  * @retval HAL_INVALID_PARAM In case of invalid parameter.
  */
hal_status_t HAL_Q_SetCircularLinkQ_Tail(hal_q_t *p_q)
{
  uint32_t head;
  uint32_t tail;
  uint32_t offset;

  ASSERT_DBG_PARAM(p_q != NULL);
  ASSERT_DBG_PARAM(p_q->p_head_node != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_q->p_tail_node ==  NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  head   = (uint32_t)p_q->p_head_node;
  tail   = (uint32_t)p_q->p_tail_node;
  offset = p_q->next_addr_offset;

  /* Link the tail node to itself */
  p_q->p_set_node(head, tail, tail, offset);

  /* Update first circular node in Q */
  p_q->p_first_circular_node = p_q->p_tail_node;

  return HAL_OK;
}

/**
  * @brief Clear circular mode of Q.
  * @param p_q     Pointer to a hal_q_t structure that contains Q information.
  * @retval HAL_OK In case of Q is Cleared.
  */
hal_status_t HAL_Q_ClearCircularLinkQ(hal_q_t *p_q)
{
  uint32_t tail;
  uint32_t offset;

  ASSERT_DBG_PARAM(p_q != NULL);
  ASSERT_DBG_PARAM(p_q->p_head_node != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_q->p_tail_node ==  NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  tail   = (uint32_t)p_q->p_tail_node;
  offset = p_q->next_addr_offset;

  /* Clear circular link within tail node */
  p_q->p_set_node(0U, tail, 0U, offset);

  /* Update first circular node in Q */
  p_q->p_first_circular_node = NULL;

  return HAL_OK;
}
#endif /* USE_HAL_Q_CIRCULAR_LINK */
/**
  * @}
  */

/**
  * @}
  */


/** @addtogroup Q_Private_Functions
  * @{
  */

/**
  * @brief Unlink all Q nodes.
  * @param p_q            Pointer to a hal_q_t structure that contains Q information.
  * @param head_node_addr Head node address.
  */
static void Q_UnlinkNodes(hal_q_t *p_q, uint32_t head_node_addr)
{
  uint32_t current_node = head_node_addr;
  uint32_t offset       = p_q->next_addr_offset;
  uint32_t next_node;

  /* Repeat for all Q nodes */
  while (p_q->node_nbr > 0U)
  {
    next_node = p_q->p_get_node(head_node_addr, current_node, offset);
    p_q->p_set_node(0U, current_node, 0U, offset);
    current_node = next_node;
    p_q->node_nbr--;
  }
}

/**
  * @brief Reset Q information.
  * @param p_q Pointer to a hal_q_t structure that contains Q information.
  */
static void Q_ResetInfo(hal_q_t *p_q)
{
  p_q->p_head_node           = NULL;
  p_q->p_tail_node           = NULL;
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  p_q->p_first_circular_node = NULL;
#endif /* USE_HAL_Q_CIRCULAR_LINK */
}

/**
  * @brief Find node in Q.
  * @param p_q              Pointer to a hal_q_t structure that contains Q information.
  * @param head_node_addr   Head node address.
  * @param node_addr        Node address to find.
  * @param p_prev_node_addr Pointer to previous Node address.
  * @retval HAL_OK          In case of node was found.
  * @retval HAL_ERROR       In case of p_first_circular_node node not found in the Q.
  */
static hal_status_t Q_FindNode(const hal_q_t *p_q, uint32_t head_node_addr, uint32_t node_addr,
                               uint32_t *p_prev_node_addr)
{
  uint32_t current_node_addr = head_node_addr;
  uint32_t offset            = p_q->next_addr_offset;
  uint32_t current_node_idx  = 0U;

  /* Loop while node not found */
  while ((current_node_addr != node_addr) && (current_node_idx < p_q->node_nbr))
  {
    if (p_prev_node_addr != NULL)
    {
      *p_prev_node_addr = current_node_addr;
    }

