STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/hal/stm32u5xx_hal_q.c
    current_node_addr = p_q->p_get_node(head_node_addr, current_node_addr, offset);
    current_node_idx++;
  }

  if ((current_node_idx == p_q->node_nbr) && (current_node_addr != node_addr))
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

#if (USE_HAL_Q_BASE_OFFSET_ADDR_MODE) && (USE_HAL_Q_BASE_OFFSET_ADDR_MODE == 1)
/**
  * @brief  Check the address of the node to be inserted into the Q is valid
  * @note   This function is used on case of base offset address mode
  * @param  p_q          Pointer to a hal_q_t structure that contains Q information.
  * @param  start_node   Start Node address.
  * @param  node         Node address to format.
  * @param  mode         Node operation to execute.
  * @retval HAL_OK       In case of valid node address.
  * @retval HAL_ERROR    In case of invalid node address.
  */
static hal_status_t Q_IsValidNodeAddr(const hal_q_t *p_q, uint32_t start_node, uint32_t node, q_check_nodes_t mode)
{
  uint32_t head_addr    = (uint32_t)p_q->p_head_node;
  uint32_t offset       = p_q->next_addr_offset;
  uint32_t current_addr = start_node;

  if (mode == Q_CHECK_HEAD_NODE)
  {
    if (current_addr >= node)
    {
      return HAL_ERROR;
    }
  }
  else
  {
    do
    {
      if (current_addr <= node)
      {
        return HAL_ERROR;
      }

      current_addr = p_q->p_get_node(head_addr, current_addr, offset);

    } while (current_addr != head_addr);
  }

  return HAL_OK;
}

/**
  * @brief  Format base offset nodes link.
  * @param  p_q            Pointer to a hal_q_t structure that contains Q information.
  * @param  node           Node address to format.
  * @param  node_operation Node operation to execute.
  */
static void Q_FormatBaseOffsetNodes(const hal_q_t *p_q, uint32_t node, q_operation_t node_operation)
{
  uint32_t node_num;
  uint32_t head_addr     = (uint32_t)p_q->p_head_node;
  uint32_t offset        = p_q->next_addr_offset;
  uint32_t previous_addr = node;
  uint32_t current_addr  = p_q->p_get_node(head_addr, previous_addr, offset);

  if (node_operation == Q_INSERT_NODE)
  {
    node_num = p_q->node_nbr;
  }
  else if (node_operation == Q_REMOVE_NODE)
  {
    node_num = p_q->node_nbr - 2U;
  }
  else
  {
    current_addr = p_q->p_get_node(head_addr, head_addr, offset);
    node_num     = p_q->node_nbr - 1U;
  }

  /* Repeat for all Q nodes */
  while (node_num > 0U)
  {
    p_q->p_set_node(node, (uint32_t)previous_addr, (uint32_t)current_addr, offset);
    previous_addr = current_addr;
    current_addr = p_q->p_get_node(head_addr, (uint32_t)previous_addr, offset);

    node_num--;
  }
}

/**
  * @brief Update nodes in Q.
  * @param  p_dest_q    Pointer to a hal_q_t structure that contains Q information.
  * @param  p_src_q     Pointer to a hal_q_t structure that contains Q information
  * @param  node        Previous node.
  * @param  q_operation Q operation to execute
  */
static void Q_FormatBaseOffsetQ(const hal_q_t *p_dest_q, const hal_q_t *p_src_q, uint32_t node,
                                q_operation_t q_operation)
{
  uint32_t node_num       = p_dest_q->node_nbr - 1U;
  uint32_t previous_addr  = (uint32_t)p_src_q->p_head_node;
  uint32_t src_tail_addr  = (uint32_t)p_src_q->p_tail_node;
  uint32_t dest_head_addr = (uint32_t)p_dest_q->p_head_node;
  uint32_t dest_tail_addr = (uint32_t)p_dest_q->p_tail_node;
  uint32_t dest_offset    = p_dest_q->next_addr_offset;
  uint32_t src_offset     = p_src_q->next_addr_offset;
  uint32_t current_addr   = p_dest_q->p_get_node(previous_addr, previous_addr, dest_offset);
  uint32_t set_ref_addr   = node;
  uint32_t get_ref_addr   = previous_addr;
  uint32_t src_head_addr  = previous_addr;
  uint32_t node_addr      = set_ref_addr;

  if (q_operation == Q_INSERT_Q_HEAD)
  {
    p_src_q->p_set_node(src_head_addr, src_tail_addr, dest_head_addr, src_offset);

    previous_addr = dest_head_addr;
    current_addr  = p_dest_q->p_get_node(dest_head_addr, dest_head_addr, src_offset);
    get_ref_addr  = dest_head_addr;
  }
  else if (q_operation == Q_INSERT_Q_MIDDLE)
  {
    set_ref_addr = dest_head_addr;
  }
  else
  {
    p_dest_q->p_set_node(node_addr, dest_tail_addr, src_head_addr, dest_offset);
  }

  while (node_num > 0U)
  {
    p_dest_q->p_set_node((uint32_t)set_ref_addr, (uint32_t)previous_addr, (uint32_t)current_addr, dest_offset);
    previous_addr = current_addr;
    current_addr = p_src_q->p_get_node(get_ref_addr, (uint32_t)previous_addr, src_offset);

    node_num--;
  }

  if (q_operation == Q_INSERT_Q_MIDDLE)
  {
    previous_addr = src_tail_addr;
    current_addr  = p_dest_q->p_get_node(dest_head_addr, node_addr, dest_offset);

    do
    {
      p_dest_q->p_set_node(dest_head_addr, (uint32_t)previous_addr, (uint32_t)current_addr, dest_offset);
      previous_addr = current_addr;
      current_addr = p_dest_q->p_get_node(dest_head_addr, (uint32_t)previous_addr, dest_offset);
    } while (current_addr != dest_head_addr);

    p_dest_q->p_set_node(dest_head_addr, node_addr, src_head_addr, dest_offset);

  }
}
#endif /* USE_HAL_Q_BASE_OFFSET_ADDR_MODE */
/**
  * @}
  */

#endif /* USE_HAL_Q_DIRECT_ADDR_MODE || USE_HAL_Q_BASE_OFFSET_ADDR_MODE */

/**
  * @}
  */

/**
  * @}
  */
